## Pandas Day - 15

### melt() Function 
- **`melt()`** in Pandas is used to convert data from wide format to long format.

### Creating Sample DataFrame

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name": ["Amit", "Rahul", "Neha"],
    "Maths": [85, 78, 90],
    "Science": [88, 75, 92]
})

In [3]:
df

    Name  Maths  Science
0   Amit     85       88
1  Rahul     78       75
2   Neha     90       92

### Basic melt()

In [4]:
df_melt = pd.melt(df)
df_melt

  variable  value
0     Name   Amit
1     Name  Rahul
2     Name   Neha
3    Maths     85
4    Maths     78
5    Maths     90
6  Science     88
7  Science     75
8  Science     92

### Using id_vars

In [6]:
df_melt_id = pd.melt(df, id_vars=["Name"])
df_melt_id

    Name variable  value
0   Amit    Maths     85
1  Rahul    Maths     78
2   Neha    Maths     90
3   Amit  Science     88
4  Rahul  Science     75
5   Neha  Science     92

### Using value_vars

In [7]:
df_melt_val = pd.melt(df, id_vars=["Name"], value_vars=["Maths"])
df_melt_val

    Name variable  value
0   Amit    Maths     85
1  Rahul    Maths     78
2   Neha    Maths     90

### Renaming Columns

In [8]:
df_melt_rename = pd.melt(
    df,
    id_vars=["Name"],
    var_name="Subject",
    value_name="Marks"
)
df_melt_rename

    Name  Subject  Marks
0   Amit    Maths     85
1  Rahul    Maths     78
2   Neha    Maths     90
3   Amit  Science     88
4  Rahul  Science     75
5   Neha  Science     92